Repository: hiddenman/voip_utils
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Currency code
ru: Код валюты

source: Example: USD for US dollars
ru: Например: USD для долларов США

source: Currency name
ru: Название валюты

source: currencies
ru: валюты

source: Country code
ru: Код страны

source: Country name
ru: Название страны

source: File to load from
ru: Загрузить из файла

source: Load countries from file. Data format must be: Country code;Country name
ru: Загрузить из файла. Формат данных должен быть: Код страны;Название страны

source: countries
ru: страны

source: Operator name
ru: Название оператора

source: operators
ru: операторы

source: Area country
ru: Страна направления

source: Area code
ru: Код направления

source: Area name
ru: Название направления

source: areas
ru: направления

source: Rate operator
ru: Оператор тарифа

source: Rate area code
ru: Код направления тарифа

source: Rate area name
ru: Название направления тарифа

source: Rate area price
ru: Цена направления тарифа

source: Rate currency
ru: Валюта тарифа

source: Rate area quality
ru: Качество направления тарифа

source: Leave empty to use Normal or Unknown
ru: Не выбирайте ничего для использования качества Normal or Unknown

source: Rate start date
ru: Старт-дата тарифа

source: Leave empty to use current date. Existing rates with the same codes but different prices will be closed with yesterday end date. Existing rates name with the same codes and same prices will be changed to the new names. Existing rates with the same codes, same prices and same names will not be changed.
ru: Не заполняйте поле для использования сегодняшней даты. Существующие тарифы с теми же кодами, но отличающимися ценами будут закрыты со вчерашней стоп-датой. Существующие названия направлений тарифов с теми же кодами и теми же ценами будут изменены на новые названия. Существующие тарифы с теми же кодами, ценами и названиями не будут изменены.

source: Rate end date
ru: Стоп-дата тарифа

source: Leave empty to use 31/12/9999
ru: Не заполняйте поле для использования даты 31/12/9999

source: Load from file. Data format must be: Area codes in any format;Area name;Area price
ru: Загрузить из файла. Формат данных должен быть: Коды направления в любом формате;Название направления;Цена направления

source: Remove all rates of this operator before loading. WARNING: Only rates with selected quality will be deleted!
ru: Удалить все тарифы этого оператора перед загрузкой. ВНИМАНИЕ: Будут удалены тарифы только с выбранным качеством направлений!

source: End date must be greater then start date
ru: Стоп-дата должна быть больше старт-даты

source: rates
ru: тарифы

source: Rate code
ru: Код направления тарифа

source: Target operator
ru: Оператор таргета

source: Target area code
ru: Код направления таргета

source: Target area name
ru: Наименование кода направления таргета

source: Target price
ru: Цена таргета

source: Target currency
ru: Валюта таргета

source: Target volume
ru: Объём таргета

source: Leave empty if unknown
ru: Не заполняйте поле если неизвестно

source: Load from file. Data format must be: Target codes in any format;Target name;Target volume;Target price
ru: Загрузть из файла. Формат данных должен быть: Коды направления таргета в любом формате;Название направления таргета;Объем таргета;Цена направления таргета

source: Remove all targets of this operator before loading
ru: Удалить все таргеты этого оператора перед загрузкой

source: targets
ru: таргеты

source: Target code
ru: Код направления таргета

source: Analyse targets of operator
ru: Анализировать таргеты оператора

source: Select operator to analyse its targets
ru: Выберите оператора для анализа его таргетов

source: Use rates of operator
ru: Использовать тарифы оператора

source: You can select multiple operators or choose no one to use all of them
ru: Вы можете выбрать несколько операторов или не выбирать ни одного для поиска по всем

source: Choose rate quality to search for
ru: Выберите качество направлений тарифов для поиска

source: Do not choose anything to use all rate types
ru: Не выбирайте ничего для поиска по направлениям тарифов любого качества

source: Rate on date
ru: Действие тарифа на дату

source: Use rate which works on this date
ru: Использовать тарифы, которые действовали на эту дату

source: Choose country
ru: Выберите страну

source: Or choose country
ru: или выбрать страну

source: You can enter code or subcode (use % and _ as mask symbols)
ru: Вы можете ввести код или подкод (используйте % и _ как символы шаблона)

source: Exact area code
ru: Точное совпадение кода

source: Display only matched codes
ru: Отображать только совпадающие коды

source: Percent of the price as markup
ru: Процент от цены тарифа как накрутка

source: Add this percent of the original price to the final price and compare them. You can use negative values
ru: Добавить этот процент от цены тарифа к конечной цене и использовать в поиске. Вы можете использовать отрицательные значения

source: default (code;name;price)
ru: по умолчанию (код;наименование;цена)

source: File with rates
ru: Файл с тарифами

source: Select file with rates to convert
ru: Выберите файл с тарифами для конвертации

source: Fields order
ru: Порядок полей в файле

source: Select fields order in the file
ru: Выберите порядок полей в файле или оставьте 'по умолчанию'

source: Transliterate destination names
ru: Транслитерировать названия направлений

source: Check if you want to transliterate destination names
ru: Включите, если вы хотите транслитерировать все названия направлений

source: Reduce ranges
ru: Сокращать диапазоны кодов

source: Check if you want to reduce ranges like 79000-79999 to 79
ru: Включите, если вы хотите сокращать диапазоны кодов вида 79000-79999 до 79

source: Compact codes
ru: Сжать коды

source: Check if you want to compact output codes like 790,791..799 to 79
ru: Включите, если вы хотите сжать коды вида 790,791..799 до 79 в конечном файле

source: View operators, countries, areas, rates, targets, currencies
ru: Просмотр операторов, стран, направлений, тарифов, таргетов, валют

source: Reports
ru: Отчёты

source: Analyse rates by targets
ru: Анализ тарифов на основе таргетов

source: Utilities
ru: Инструменты

source: Convert rates
ru: Конвертер тарифов

source: Rates by targets for operator
ru: Тарифы по таргетам для оператора

source: There are no such targets.
ru: Нет таких таргетов у оператора.

source: Start analysis
ru: Запустить анализ

source: Start analysis and save as CSV
ru: Запустить анализ и сохранить в файл

source: Country
ru: Страна

source: Rate price
ru: Цена тарифа

source: Our increased price
ru: Наша цена с накруткой

source: Rate quality
ru: Качество направления тарифа

source: There are no rates for such targets.
ru: Нет тарифов для данных таргетов.

source: Convert rates file
ru: Конвертировать файл с тарифами

source: Converter will do the following operations:
ru: Конвертер произведет следующие операции:

source: Remove spaces, tabs and other whitespaces
ru: Удалит пробелы, табуляция и другие лишние символы

source: Remove english X and russian H from ranges
ru: Удалит английскую X и русскую Х из наборов кодов

source: Remove empty values and redundant commas
ru: Удалит пустые значения и лишние запятые

source: Replace commas in price or volume fields with dot
ru: Заменит запятые точкой в цене и объеме

source: Remove $ in prices
ru: Удалить $ в цене

source: If price can't be coverted to decimal change it to zero
ru: Если цену невозможно преобразовать в число, заменит её на ноль

source: Transliterate russian area names
ru: Транслитерирует русские наименования направлений

source: Expand ranges like N-M (including ranges with leading zeros)
ru: Раскроет наборы кодов виде N-M (включая наборы с нулем в начале)

source: For any kind of code arrays generate one code per raw
ru: Для любых массивов и наборов кодов сгенерирует один код на строку

source: Check for non-empty fields, code and price to be ciphers
ru: Произведет конечную проверку кодов и цены на наличие только цифр

source: Remove any non-alphabet symbols from area name
ru: Удалит все непечатные символы из названия направления

source: Check for duplicates
ru: Проверит наличие повторяющихся кодов

source: Replace PSTN and proper with Fixed, cellular with Mobile
ru: Заменит PSTN и proper на Fixed, cellular на Mobile

source: Make area name lowercased with each word's first letter capitalized
ru: Сделает все символы названия направления строчными, первые буквы отдельных слова прописными

source: Reduce ranges like 79000-79999 to 79
ru: Сократит диапазоны кодов вида 79000-79999 до 79

source: Compact codes like 790,791..799 to 79 in output file
ru: Сожмет коды вида 790,791..799 до 79 в конечном файле

source: Convert and save as CSV
ru: Конвертировать и сохранить в файл

source: Country not found for code:
ru: Не найдена страна для кода:
